ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_ctlreq.c
    phost->Control.setup.b.bRequest = USB_REQ_SET_ADDRESS;

    phost->Control.setup.b.wValue.w = (uint16_t)DeviceAddress;
    phost->Control.setup.b.wIndex.w = 0U;
    phost->Control.setup.b.wLength.w = 0U;
  }

  return USBH_CtlReq(phost, NULL, 0U);
}


/**
  * @brief  USBH_SetCfg
  *         The command sets the configuration value to the connected device
  * @param  phost: Host Handle
  * @param  cfg_idx: Configuration value
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_SetCfg(USBH_HandleTypeDef *phost, uint16_t cfg_idx)
{
  if (phost->RequestState == CMD_SEND)
  {
    phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_DEVICE
                                           | USB_REQ_TYPE_STANDARD;

    phost->Control.setup.b.bRequest = USB_REQ_SET_CONFIGURATION;
    phost->Control.setup.b.wValue.w = cfg_idx;
    phost->Control.setup.b.wIndex.w = 0U;
    phost->Control.setup.b.wLength.w = 0U;
  }

  return USBH_CtlReq(phost, NULL, 0U);
}


/**
  * @brief  USBH_SetInterface
  *         The command sets the Interface value to the connected device
  * @param  phost: Host Handle
  * @param  altSetting: Interface value
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_SetInterface(USBH_HandleTypeDef *phost, uint8_t ep_num,
                                     uint8_t altSetting)
{
  if (phost->RequestState == CMD_SEND)
  {
    phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
                                           | USB_REQ_TYPE_STANDARD;

    phost->Control.setup.b.bRequest = USB_REQ_SET_INTERFACE;
    phost->Control.setup.b.wValue.w = altSetting;
    phost->Control.setup.b.wIndex.w = ep_num;
    phost->Control.setup.b.wLength.w = 0U;
  }

  return USBH_CtlReq(phost, NULL, 0U);
}


/**
  * @brief  USBH_SetFeature
  *         The command sets the device features (remote wakeup feature,..)
  * @param  pdev: Selected device
  * @param  itf_idx
  * @retval Status
  */
USBH_StatusTypeDef USBH_SetFeature(USBH_HandleTypeDef *phost, uint8_t wValue)
{
  if (phost->RequestState == CMD_SEND)
  {
    phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_DEVICE
                                           | USB_REQ_TYPE_STANDARD;

    phost->Control.setup.b.bRequest = USB_REQ_SET_FEATURE;
    phost->Control.setup.b.wValue.w = wValue;
    phost->Control.setup.b.wIndex.w = 0U;
    phost->Control.setup.b.wLength.w = 0U;
  }

  return USBH_CtlReq(phost, NULL, 0U);
}


/**
  * @brief  USBH_ClrFeature
  *         This request is used to clear or disable a specific feature.
  * @param  phost: Host Handle
  * @param  ep_num: endpoint number
  * @param  hc_num: Host channel number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_ClrFeature(USBH_HandleTypeDef *phost, uint8_t ep_num)
{
  if (phost->RequestState == CMD_SEND)
  {
    phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_ENDPOINT
                                           | USB_REQ_TYPE_STANDARD;

    phost->Control.setup.b.bRequest = USB_REQ_CLEAR_FEATURE;
    phost->Control.setup.b.wValue.w = FEATURE_SELECTOR_ENDPOINT;
    phost->Control.setup.b.wIndex.w = ep_num;
    phost->Control.setup.b.wLength.w = 0U;
  }
  return USBH_CtlReq(phost, NULL, 0U);
}


/**
  * @brief  USBH_ParseDevDesc
  *         This function Parses the device descriptor
  * @param  dev_desc: device_descriptor destination address
  * @param  buf: Buffer where the source descriptor is available
  * @param  length: Length of the descriptor
  * @retval None
  */
static void  USBH_ParseDevDesc(USBH_HandleTypeDef *phost, USBH_DevDescTypeDef *dev_desc, uint8_t *buf, uint16_t length)
{
	  //USBH_StatusTypeDef status = USBH_OK;

	  if (buf == NULL)
	  {
	    return;
	  }

	  dev_desc->bLength            = *(uint8_t *)(buf +  0U);
	  dev_desc->bDescriptorType    = *(uint8_t *)(buf +  1U);
	  dev_desc->bcdUSB             = LE16(buf +  2U);
	  dev_desc->bDeviceClass       = *(uint8_t *)(buf +  4U);
	  dev_desc->bDeviceSubClass    = *(uint8_t *)(buf +  5U);
	  dev_desc->bDeviceProtocol    = *(uint8_t *)(buf +  6U);
	  dev_desc->bMaxPacketSize     = *(uint8_t *)(buf +  7U);

	  if ((phost->currentTarget->speed == (uint8_t)USBH_SPEED_HIGH) ||
	      (phost->currentTarget->speed == (uint8_t)USBH_SPEED_FULL))
	  {
	    /* Make sure that the max packet size is either 8, 16, 32, 64 or force it to minimum allowed value */
	    switch (dev_desc->bMaxPacketSize)
	    {
	      case 8:
	      case 16:
	      case 32:
	      case 64:
	        break;

	      default:
	        /* set the size to min allowed value in case the device has answered with incorrect size */
	        dev_desc->bMaxPacketSize = 8U;
	        break;
	    }
	  }
	  else if (phost->currentTarget->speed == (uint8_t)USBH_SPEED_LOW)
	  {
	    if (dev_desc->bMaxPacketSize != 8U)
	    {
	      /* set the size to 8 in case the device has answered with incorrect size */
	      dev_desc->bMaxPacketSize = 8U;
	    }
	  }
	  else
	  {
	    //status = USBH_NOT_SUPPORTED;
	  }

	  if (length > 8U)
	  {
	    /* For 1st time after device connection, Host may issue only 8 bytes for
	    Device Descriptor Length  */
	    dev_desc->idVendor           = LE16(buf +  8);
	    dev_desc->idProduct          = LE16(buf + 10);
	    dev_desc->bcdDevice          = LE16(buf + 12);
	    dev_desc->iManufacturer      = *(uint8_t *)(buf + 14);
	    dev_desc->iProduct           = *(uint8_t *)(buf + 15);
	    dev_desc->iSerialNumber      = *(uint8_t *)(buf + 16);
	    dev_desc->bNumConfigurations = *(uint8_t *)(buf + 17);
	  }

}


/**
  * @brief  USBH_ParseCfgDesc
  *         This function Parses the configuration descriptor
  * @param  phost: USB Host handler
  * @param  buf: Buffer where the source descriptor is available
  * @param  length: Length of the descriptor
  * @retval USBH statuse
  */
static USBH_StatusTypeDef USBH_ParseCfgDescOld(USBH_HandleTypeDef *phost, uint8_t *buf, uint16_t length)
 {
	USBH_CfgDescTypeDef *cfg_desc = &phost->device.CfgDesc;
	USBH_StatusTypeDef status = USBH_OK;
	USBH_InterfaceDescTypeDef *pif;
	USBH_EpDescTypeDef *pep;
	USBH_DescHeader_t *pdesc = (USBH_DescHeader_t*) (void*) buf;
	uint16_t ptr;
	uint8_t if_ix = 0U;
	uint8_t ep_ix = 0U;

