ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_ctlreq.c
	pdesc = (USBH_DescHeader_t*) (void*) buf;

	/* Parse configuration descriptor */
	cfg_desc->bLength = *(uint8_t*) (buf + 0);
	cfg_desc->bDescriptorType = *(uint8_t*) (buf + 1);
	cfg_desc->wTotalLength = MIN(((uint16_t) LE16(buf + 2)),
			((uint16_t)USBH_MAX_SIZE_CONFIGURATION));
	cfg_desc->bNumInterfaces = *(uint8_t*) (buf + 4);
	cfg_desc->bConfigurationValue = *(uint8_t*) (buf + 5);
	cfg_desc->iConfiguration = *(uint8_t*) (buf + 6);
	cfg_desc->bmAttributes = *(uint8_t*) (buf + 7);
	cfg_desc->bMaxPower = *(uint8_t*) (buf + 8);

	/* Make sure that the Confguration descriptor's bLength is equal to USB_CONFIGURATION_DESC_SIZE */
	if (cfg_desc->bLength != USB_CONFIGURATION_DESC_SIZE) {
		cfg_desc->bLength = USB_CONFIGURATION_DESC_SIZE;
	}

	if (length > USB_CONFIGURATION_DESC_SIZE) {
		ptr = USB_LEN_CFG_DESC;
		pif = (USBH_InterfaceDescTypeDef*) NULL;

		while ((if_ix < USBH_MAX_NUM_INTERFACES)
				&& (ptr < cfg_desc->wTotalLength)) {
			pdesc = USBH_GetNextDesc((uint8_t*) (void*) pdesc, &ptr);
			if (pdesc->bDescriptorType == USB_DESC_TYPE_INTERFACE) {
				/* Make sure that the interface descriptor's bLength is equal to USB_INTERFACE_DESC_SIZE */
				if (pdesc->bLength != USB_INTERFACE_DESC_SIZE) {
					pdesc->bLength = USB_INTERFACE_DESC_SIZE;
				}

				pif = &cfg_desc->Itf_Desc[if_ix];
				USBH_ParseInterfaceDesc(pif, (uint8_t*) (void*) pdesc);

				ep_ix = 0U;
				pep = (USBH_EpDescTypeDef*) NULL;

				while ((ep_ix < pif->bNumEndpoints)
						&& (ptr < cfg_desc->wTotalLength)) {
					pdesc = USBH_GetNextDesc((uint8_t*) (void*) pdesc, &ptr);

					if (pdesc->bDescriptorType == USB_DESC_TYPE_ENDPOINT) {
						/* Check if the endpoint is appartening to an audio streaming interface */
						if ((pif->bInterfaceClass == 0x01U)
								&& (pif->bInterfaceSubClass == 0x02U)) {
							/* Check if it is supporting the USB AUDIO 01 class specification */
							if ((pif->bInterfaceProtocol == 0x00U)
									&& (pdesc->bLength != 0x09U)) {
								pdesc->bLength = 0x09U;
							}
						}
						/* Make sure that the endpoint descriptor's bLength is equal to
						 USB_ENDPOINT_DESC_SIZE for all other endpoints types */
						else if (pdesc->bLength != USB_ENDPOINT_DESC_SIZE) {
							pdesc->bLength = USB_ENDPOINT_DESC_SIZE;
						} else {
							/* ... */
						}

						pep = &cfg_desc->Itf_Desc[if_ix].Ep_Desc[ep_ix];

						status = USBH_ParseEPDesc(phost, pep,
								(uint8_t*) (void*) pdesc);

						ep_ix++;
					}
				}

				/* Check if the required endpoint(s) data are parsed */
				if (ep_ix < pif->bNumEndpoints) {
					return USBH_NOT_SUPPORTED;
				}

				if_ix++;
			}
		}

		/* Check if the required interface(s) data are parsed */
		if (if_ix
				< MIN(cfg_desc->bNumInterfaces,
						(uint8_t)USBH_MAX_NUM_INTERFACES)) {
			return USBH_NOT_SUPPORTED;
		}
	}

	return status;
}

/**
  * @brief  USBH_ParseCfgDesc
  *         This function Parses the configuration descriptor
  * @param  phost: USB Host handler
  * @param  buf: Buffer where the source descriptor is available
  * @param  length: Length of the descriptor
  * @retval USBH statuse
  */
static USBH_StatusTypeDef USBH_ParseCfgDesc(USBH_HandleTypeDef *phost, uint8_t *buf, uint16_t length)
 {
	USBH_CfgDescTypeDef *cfg_desc = &phost->device.CfgDesc;
	USBH_StatusTypeDef status = USBH_OK;
	USBH_InterfaceDescTypeDef *pif;
	USBH_EpDescTypeDef *pep;
	uint16_t ptr;
	uint8_t ep_ix = 0U;
	USBH_DescHeader_t *pdesc = (USBH_DescHeader_t*) buf;

	uint_fast8_t iadmode = 0;
	pdesc = (USBH_DescHeader_t*) buf;

	/* Parse configuration descriptor */
	cfg_desc->bLength = *(uint8_t*) (buf + 0);
	cfg_desc->bDescriptorType = *(uint8_t*) (buf + 1);
	cfg_desc->wTotalLength = LE16(buf + 2);
	cfg_desc->bNumInterfaces = *(uint8_t*) (buf + 4);
	cfg_desc->bConfigurationValue = *(uint8_t*) (buf + 5);
	cfg_desc->iConfiguration = *(uint8_t*) (buf + 6);
	cfg_desc->bmAttributes = *(uint8_t*) (buf + 7);
	cfg_desc->bMaxPower = *(uint8_t*) (buf + 8);

	if (length > USB_CONFIGURATION_DESC_SIZE) {
		uint16_t ptr;
		int8_t if_ix = 0;
		int8_t ep_ix = 0;
		ptr = USB_LEN_CFG_DESC;
		pif = (USBH_InterfaceDescTypeDef*) NULL;

		while ((if_ix < USBH_MAX_NUM_INTERFACES)
				&& (ptr < cfg_desc->wTotalLength)) {
			pdesc = USBH_GetNextDesc((uint8_t*) pdesc, &ptr);

			if (pdesc->bDescriptorType == USB_DESC_TYPE_ASSOC) {
				iadmode = 1;
				USBH_IfAssocDescTypeDef *piad = (USBH_IfAssocDescTypeDef*) pdesc;
				USBH_DbgLog(
						"USBH_ParseCfgDesc: USB_DESC_TYPE_ASSOC: 0x%02X/x%02X, nif=%d, firstIf=%d",
						piad->bFunctionClass, piad->bFunctionSubClass,
						piad->bInterfaceCount, piad->bFirstInterface);
			} else if (/*iadmode == 0 && */pdesc->bDescriptorType
					== USB_DESC_TYPE_INTERFACE) {
				pif = &cfg_desc->Itf_Desc[if_ix];
				USBH_ParseInterfaceDesc(pif, (uint8_t*) pdesc);

				USBH_DbgLog(
						"USBH_ParseCfgDesc: ifix=%d, alt=%d, 0x%02X/0x%02X/0x%02X, nEP=%d",
						pif->bInterfaceNumber, pif->bAlternateSetting, pif->bInterfaceClass,
						pif->bInterfaceSubClass, pif->bInterfaceProtocol,
						pif->bNumEndpoints);
				// 0x08/0x06/0x50: USB flash
				// 0xFF/0x00/0x00: CP2102
				// 0x03/0x01/0x02: USB-PS/2 Optical Mouse
				//
				// Composite device (Audio+2xCDC):
				// 0x01/0x01/0x00, nEP=0
				// 0x01/0x02/0x00, nEP=0
				// 0x01/0x02/0x00, nEP=1
				// 0x01/0x02/0x00, nEP=0
				// 0x01/0x02/0x00, nEP=1
				// 0x02/0x02/0x01, nEP=1
				// 0x0A/0x00/0x00, nEP=2
				// 0x02/0x02/0x01, nEP=1
				// 0x0A/0x00/0x00, nEP=2
				//
				// Gigabit Ethernet
				//	USB Device Reset Completed
				//	VID/PID: 0BDA/8153
				//	Address (#7) assigned.
				//	DEBUG : USBH_ParseCfgDesc: ifix=0, 0xFF/0xFF/0x00, nEP=3
				//	DEBUG : USBH_ParseCfgDesc: EPix=0, bEndpointAddress=81, wMaxPacketSize=512
				//	DEBUG : USBH_ParseCfgDesc: EPix=1, bEndpointAddress=02, wMaxPacketSize=512
				//	DEBUG : USBH_ParseCfgDesc: EPix=2, bEndpointAddress=83, wMaxPacketSize=2
				//	EHCI_StopHost:
				//	USB Device disconnected
				//	USB Device Reset Completed
				//	VID/PID: 0BDA/8151
				//	Address (#7) assigned.
				//	DEBUG : USBH_ParseCfgDesc: ifix=0, 0x08/0x06/0x50, nEP=2
				//	DEBUG : USBH_ParseCfgDesc: EPix=0, bEndpointAddress=84, wMaxPacketSize=512
				//	DEBUG : USBH_ParseCfgDesc: EPix=1, bEndpointAddress=05, wMaxPacketSize=512

